[
    {
        "id": 1,
        "title": "ThinkFlash: AI Flash Cards",
        "tech": [
            "React",
            "MongoDB",
            "Express",
            "Node.js",
            "JWT Auth",
            "CSS",
            "OpenAI API"
        ],
        "desc": "This innovative project empowers users to create flash cards effortlessly using artificial intelligence technology. Built with the MERN stack, the application offers a seamless user experience with features such as JWT authentication for secure access and integration with the OpenAI API for advanced AI capabilities.",
        "img": "../assets/projects/thinkFlashScreenShot.png",
        "liveSite": "https://thinkflash-0iex.onrender.com/",
        "github": "https://github.com/AnthonyBuffill/thinkFlash"
    },
    {
        "id": 2,
        "title": "Scoot Remix App",
        "tech": [
            "Remix",
            "React",
            "TypeScript",
            "HTML5",
            "FlexBox"
        ],
        "desc": "A multi-page, style-rich, website using Remix, React, TypeScript, SASS. User should be able to View the optimal layout for each page depending on their device's screen size,  and see hover states for all interactive elements throughout the site.",
        "img": "../assets/projects/scoot.png",
        "liveSite": "https://scoot-multipage.vercel.app/",
        "github": "https://github.com/KarenDouglas/Scoot-Multipage-Website"
    },
    {
        "id": 3,
        "title": "In My Feelings",
        "tech": [
            "JavaScript",
            "Node.js",
            "Handlebars",
            "Sequelize",
            "MySQL",
            "Express-session",
            "BCrypt"
        ],
        "desc": "This platform offers users a seamless experience for reading, creating, and interacting with blog posts. With a diverse array of topics to explore, users can engage with the community by leaving comments and contribute their own posts to share experiences and insights. The intuitive dashboard allows for easy post.",
        "img": "../assets/projects/inmyfeelingScreenShot.png",
        "liveSite": "https://inmyfeelings-617a8f81f293.herokuapp.com/",
        "github": "https://github.com/KarenDouglas/inMyFeelings/"
    },
    {
        "id": 4,
        "title": "Word Guessing Game",
        "tech": [
            "JavaScript",
            "HTML5",
            "CSS",
            "MaterialCSS",
            "Local Storage"
        ],
        "desc": "This project offers users an engaging and challenging experience where they can test their word-guessing skills. Players have 10 attempts to guess the correct word by typing in letters, with the help of hints provided by the Dictionary API. The game generates a random word for players to guess, ensuring each round is unique and exciting.",
        "img": "../assets/projects/wordGuessingGame.png",
        "liveSite": "https://karendouglas.github.io/word-guessing-game/",
        "github": "https://github.com/KarenDouglas/word-guessing-game"
    },
    {
        "id": 5,
        "title": "Code Quiz",
        "tech": [
            "HTML5",
            "CSS",
            "JavaScript",
            "Local Storage",
            "Figma"
        ],
        "desc": "This project offers a timed quiz where users answer coding questions within 100 seconds, earning points for correct answers and losing time for incorrect ones. Built with JavaScript, HTML, and CSS, it uses dynamic programming and local storage to track scores. Whether you're a coding enthusiast or beginner, join us for a challenging game.",
        "img": "../assets/projects/codeQuiz.png",
        "liveSite": "https://karendouglas.github.io/code-quiz/",
        "github": "https://github.com/KarenDouglas/code-quiz"
    },
    {
        "id": 6,
        "title": "This Porfolio Website",
        "tech": [
            "JavaScript",
            "React",
            "React Router",
            "Vite",
            "HTML5",
            "CSS"
        ],
        "desc": "This platform serves as a gateway for users to learn more about me as a software developer and explore my recent projects. Through this responsive website, users can gain insights into my skills, experience, and passion for coding. Whether you're curious about my background, interested in collaborating on projects",
        "img": "../assets/projects/karenPortfolioSite.png",
        "liveSite": "",
        "github": "https://github.com/KarenDouglas/MyPortfolioWebsite-React"
    }
]
